In [1]:
import pandas as pd

In [2]:
import numpy as np

In [5]:
data={'id':[1,2,3,4,5],'name':["alice","bob","charli","david","emma"],'age':[25,30,35,40,28],'city':["new york","chicago","boston","seattle","austin"],'salary':[50000,60000,55000,70000,65000]}
df=pd.DataFrame(data)
df

   id    name  age      city  salary
0   1   alice   25  new york   50000
1   2     bob   30   chicago   60000
2   3  charli   35    boston   55000
3   4   david   40   seattle   70000
4   5    emma   28    austin   65000

In [6]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
df.shape
df.dtypes
df.size

25

In [14]:
lst=[1,2,3,4,5]
s1=pd.Series(lst,index=range(10,15,1))
s1

10    1
11    2
12    3
13    4
14    5
dtype: int64

In [16]:
s1.iloc[2]=100
s1

10      1
11      2
12    100
13      4
14      5
dtype: int64